In [51]:
import easyaccess as ea
import pandas as pd
import numpy as np

In [52]:
db = ea.connect(section = 'desoper')

Connecting to DB ** desoper ** ...

In [53]:
cmd = 'create table lzullo.burritos  \
       (\
          NAME     varchar2(80),  \
          LOCATION  varchar2(80),  \
          PRICE      number(9,6),  \
          TYPE     varchar2(80),  \
          QUALITY    number(9,6)   \
       )'

In [54]:
db = ea.connect(section='desoper')
cursor = db.cursor()
try:
    cursor.execute('drop table lzullo.burritos')     # drop this table in case there was an existing copy
    cursor.execute(cmd)
except:
    cursor.execute(cmd)

Connecting to DB ** desoper ** ...

In [55]:
result = db.query_to_pandas('select * from lzullo.burritos')

In [56]:
result.head()

Empty DataFrame
Columns: [NAME, LOCATION, PRICE, TYPE, QUALITY]
Index: []

In [57]:
cmds = ["INSERT INTO lzullo.burritos (NAME, LOCATION, PRICE, TYPE, QUALITY) \
VALUES ('The Chicken Tender', 'Chipotle', 7, 'Chicken', 3)",
        "INSERT INTO lzullo.burritos (NAME, LOCATION, PRICE, TYPE, QUALITY) \
VALUES ('The Quadruple Bypass', 'Qdoba',10, 'Beef', 6)",
        "INSERT INTO lzullo.burritos (NAME, LOCATION, PRICE, TYPE, QUALITY) \
VALUES ('The Hipster', 'San Fran', 16, 'love', 2)",
        "INSERT INTO lzullo.burritos (NAME, LOCATION, PRICE, TYPE, QUALITY) \
VALUES ('The Trump', 'Mexico', 100, 'White ', 0)",
        "INSERT INTO lzullo.burritos (NAME, LOCATION, PRICE, TYPE, QUALITY) \
VALUES ('The New Porker', 'Florida', 9, 'Pork ',10)"]

In [58]:
for c in cmds:
    cursor.execute(c)

In [59]:
result = db.query_to_pandas('select * from lzullo.burritos')
result.head(len(result))

                   NAME  LOCATION  PRICE     TYPE  QUALITY
0    The Chicken Tender  Chipotle    7.0  Chicken      3.0
1  The Quadruple Bypass     Qdoba   10.0     Beef      6.0
2           The Hipster  San Fran   16.0     love      2.0
3             The Trump    Mexico  100.0   White       0.0
4        The New Porker   Florida    9.0    Pork      10.0

In [60]:
cmds = ["INSERT INTO lzullo.burritos (NAME, LOCATION, PRICE, TYPE, QUALITY) \
VALUES ('TestBurrito', 'Ann Arbor', 3, 'Vegan', 4)"]

In [61]:
for c in cmds:
    cursor.execute(c)

In [62]:
result = db.query_to_pandas('select * from lzullo.burritos')
result.head(len(result))

                   NAME   LOCATION  PRICE     TYPE  QUALITY
0    The Chicken Tender   Chipotle    7.0  Chicken      3.0
1  The Quadruple Bypass      Qdoba   10.0     Beef      6.0
2           The Hipster   San Fran   16.0     love      2.0
3             The Trump     Mexico  100.0   White       0.0
4        The New Porker    Florida    9.0    Pork      10.0
5           TestBurrito  Ann Arbor    3.0    Vegan      4.0

In [63]:
print result['NAME'][3]

The Trump

In [64]:
for c in cmds:
    result['NAME'][3] = 'The Bernie'

In [65]:
print result['NAME'][3]

The Bernie

In [66]:
result = db.query_to_pandas('select * from lzullo.burritos')
result.head(len(result))

                   NAME   LOCATION  PRICE     TYPE  QUALITY
0    The Chicken Tender   Chipotle    7.0  Chicken      3.0
1  The Quadruple Bypass      Qdoba   10.0     Beef      6.0
2           The Hipster   San Fran   16.0     love      2.0
3             The Trump     Mexico  100.0   White       0.0
4        The New Porker    Florida    9.0    Pork      10.0
5           TestBurrito  Ann Arbor    3.0    Vegan      4.0

In [72]:
cursor.execute("update BURRITOS set price = 14 where name = 'The Hipster'")

In [74]:
result = db.query_to_pandas('select * from lzullo.burritos')
result.head(len(result))

                   NAME   LOCATION  PRICE     TYPE  QUALITY
0    The Chicken Tender   Chipotle    7.0  Chicken      3.0
1  The Quadruple Bypass      Qdoba   10.0     Beef      6.0
2           The Hipster   San Fran   14.0     love      2.0
3             The Trump     Mexico  100.0   White       0.0
4        The New Porker    Florida    9.0    Pork      10.0
5           TestBurrito  Ann Arbor    3.0    Vegan      4.0